88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp

/****************************************************************/
// ePaperAnchorAlarm by. M. Preidel
/****************************************************************/

#include <Arduino.h>
#include <math.h>

//**** ESP32 sleep and rtc memory (which survives deep sleep)
#include "esp_sleep.h"
#include "driver/rtc_io.h"

#include <SimpleTimer.h>        // Simple Timer, used instead of Blynk timer for virtuino
SimpleTimer gpsTimer;
int gpsTimerHandle=1;

// ** rotary encoder lib
#include <ESP32Encoder.h>
#define ENCODER_CLK_PIN 22 //25
#define ENCODER_DT_PIN 27
#define ENCODER_SW_PIN 26

// button stuff from ePaperBarograf
#define BUTTON1 GPIO_NUM_26
struct Button {
  const uint8_t PIN;
  uint32_t numberKeyPresses;
  bool pressed;
};
volatile Button button1 = {ENCODER_SW_PIN, 0, false};

void ARDUINO_ISR_ATTR button1Handler();

// include bounce2 library for button debouncing
#include <Bounce2.h>
Bounce button = Bounce();

// GPIO for measurement of voltage
#define VOLTAGE_PIN 39

// TinyGPSPlus library for GPS handling
#include <TinyGPSPlus.h>
// #include <SoftwareSerial.h>

// float volt, percent;                    // battery voltage and percent fill degree

static const int RXPin = 19, TXPin = 15; //22;
static const uint32_t GPSBaud = 9600;

TinyGPSPlus gps;  // The TinyGPSPlus object
HardwareSerial ss(1); // The serial connection to the GPS device

// for tests latitude and longitude of start position
double startLat = 0.0;
double startLon = 0.0;
double anchorDistance_m = 23;
double anchorBearing_deg = 45.0;
double anchorLat = 0.0;
double anchorLon = 0.0;

// ADC calibration stuff
// https://www.reddit.com/r/esp32/comments/1g4ma01/esp32_s3_adc/?rdt=46482
#include <esp_adc_cal.h>

#if CONFIG_IDF_TARGET_ESP32
#define ADC_EXAMPLE_CALI_SCHEME     ESP_ADC_CAL_VAL_EFUSE_VREF
#elif CONFIG_IDF_TARGET_ESP32S3
#define ADC_EXAMPLE_CALI_SCHEME     ESP_ADC_CAL_VAL_EFUSE_TP_FIT
#endif
#define VREF 0

// *** lib for permanent data storage in EEPROM
// https://randomnerdtutorials.com/esp32-save-data-permanently-preferences/
// if these defines are set, preferences are written / saved to eeprom. 
// otherwise just from RTC storage (survives deep sleep)
#define WRITE_PREFERENCES
#define READ_PREFERENCES
#include <Preferences.h>
Preferences preferences; // object for preference storage in EEPROM
#define prefIDENT "ePaperAnchorAlarm" // unique identifier for preferences

// header file mit #defines, forward declarations, "extern" declarations von woanders deklarierten globalen var's
// globale variablen und alle anderen #includes sind im .cpp file
#include "ePaperAnchorAlarm.h"
#include "global.h" // global stuff from other modules

//float volt, percent;                    // battery voltage and percent fill degree

char outstring[maxLOG_STRING_LEN];      // for serial and other debug output

//----------------------- measurement data variables -----------------------
uint32_t startTimeMillis; 

ESP32Encoder encoder;  // rotary encoder object

// measurement data, stored in RTC memory which survives the deep sleep. ESP32 has 8 K, used for this 5448 Bytes
RTC_DATA_ATTR measurementData wData;

// screen colors
RTC_DATA_ATTR uint32_t fgndColor;
RTC_DATA_ATTR uint32_t bgndColor;

// determine after how many partial updates a full update of the epaper is to be done
// 1: always full update
#ifdef LOLIN32_LITE
  #define FULL_UPDATE_INTERVAL  10
#endif

// GPIO definition for battery voltage reading
#define VOLTAGE_PIN 39

// GPIO definition for buzzer
#define BUZZER_PIN 2

// store these variables in RTC memory, which survives deep sleep. 
//RTC_DATA_ATTR uint32_t startCounter = 0; // 25920;  // total counter for starts of ESP32
//RTC_DATA_ATTR uint32_t dischgCnt = 0;    // counter for starts of ESP32 since last charge
//RTC_DATA_ATTR uint32_t prevMicrovolt = 0;
//RTC_DATA_ATTR float prevVoltage = 0;

// test control variables
bool testRotaryEncoder = false;
bool testGPSModule = true;
bool testBuzzer = true;
bool testDisplayModule = false;


/**************************************************!
   @brief    logOut()
   @details  Function create log output
   @return   void
***************************************************/
void logOut(int logLevel, char* str)
{
  char safeStr[maxLOG_STRING_LEN+10];
  static uint32_t logCnt = 0;
  // for safety: ensure zero termination well before the end of the string
  // crashes with static strings.
  // str[maxLOG_STRING_LEN-1]=0;
  if(logLevel <= logLEVEL){
    strncat(safeStr, str, maxLOG_STRING_LEN-1); // copy limited number of characters only
    sprintf(safeStr,"%ld %s",logCnt,str);
    //Serial.println(str);
    Serial.println(safeStr);
    logCnt++;
  }
}

/*************************** getBatteryCapacity ************************** */
int readBatteryVoltage(float* percent, float* volt)
{
  uint16_t readval;
  uint32_t millivolts1, millivolts2;

  esp_adc_cal_characteristics_t adc_chars;

  *percent = 100;
  pinMode(VOLTAGE_PIN, INPUT);

  esp_adc_cal_value_t efuse_config = esp_adc_cal_characterize(
      ADC_UNIT_1, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, VREF, &adc_chars);
  if (efuse_config != ESP_ADC_CAL_VAL_EFUSE_TP_FIT) {
    logOut(2, (char*)"ALERT, ADC calibration failed");
  }

  millivolts1 = analogReadMilliVolts(VOLTAGE_PIN);

  uint32_t raw = analogRead(VOLTAGE_PIN);
  millivolts2 = esp_adc_cal_raw_to_voltage(raw, &adc_chars);
  sprintf(outstring,"millivolts1: %ld raw: %ld, millivolts2: %ld",
    millivolts1, raw, millivolts2);
  logOut(2,outstring);

  // Original, works well on Lolin32
  readval = analogRead(VOLTAGE_PIN);// / 4096.0 * 7.23;      // LOLIN D32 (no voltage divider need already fitted to board.or NODEMCU ESP32 with 100K+100K voltage divider
  *volt= (float)readval / 4096.0 * 7.23;
  //float voltage = analogRead(39) / 4096.0 * 7.23;    // NODEMCU ESP32 with 100K+100K voltage divider added
  //float voltage = analogRead(A0) / 4096.0 * 4.24;    // Wemos / Lolin D1 Mini 100K series resistor added
  //float voltage = analogRead(A0) / 4096.0 * 5.00;    // Ardunio UNO, no voltage divider required
  
