88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
}

/**************************************************!
   @brief    smartDelay()
   @details  This custom version of delay() ensures that the gps object is being "fed".
   @details  It should be used instead of delay() when waiting for GPS data.
   @details  however, it utilizes a blocking delay, so no other tasks can be done during this time.
   @param    unsigned long ms : delay time in milliseconds
   @return   void
***************************************************/
static void smartDelay(unsigned long ms)
{
  char ch;
  unsigned long start = millis();
  do 
  {
    while (ss.available()){
      ch = ss.read();
      //Serial.write(ch); // uncomment to see raw GPS data 
      gps.encode(ch);
    }  
  } while (millis() - start < ms);
}

/**************************************************!
   @brief    gpsHandler()
   @details  Function to handle input from gps module, called by timer
***************************************************/
void gpsHandler(){
  char ch;
  while (ss.available()){
    ch = ss.read();
    //Serial.write(ch); // uncomment to see raw GPS data 
    gps.encode(ch);
  }   
}

/**************************************************!
   @brief    gpsTest()
   @details  Function to test gps module
   @param    void 
   @return   true if gps location is valid, else false
***************************************************/
boolean gpsTest()
{
  smartDelay(1000); // wait for 1 second while feeding gps object
  displayGPSInfo();  // get and display GPS info
  return gps.location.isValid();
}

/**************************************************!
   @brief    buzzer()
   @details  Function to create a buzzer sound
   @param    uint16_t number    : how many buzzes
   @param    uint16_t duration : how long in ms for every buzz
   @param    uint16_t interval : how long in ms between buzzes
   @return   void
***************************************************/
void buzzer(uint16_t number, uint16_t duration, uint16_t interval)
{
  //logOut(2, (char*)"Start Buzzer");  
  uint16_t i;
  for(i=0; i<number; i++){
    pinMode(BUZZER_PIN, OUTPUT);
    digitalWrite(BUZZER_PIN, HIGH); // buzzer on
    delay(duration);
    digitalWrite(BUZZER_PIN, LOW); // buzzer off
    delay(interval);
  }  
  //logOut(2, (char*)"End of Buzzer");
}    

/**************************************************!
   @brief    parallelBuzzer()
   @details  Function to create a buzzer sound in parallel thread. Self-ending
   @param    uint16_t number    : how many buzzes
   @param    uint16_t duration : how long in ms for every buzz
   @param    uint16_t interval : how long in ms between buzzes
   @return   void
***************************************************/
struct buzzerDataType
{
  uint16_t number; 
  uint16_t duration; 
  uint16_t interval;
};
buzzerDataType buzzerParam;

void parallelBuzzer(void *param)
{
  uint16_t i;
  buzzerDataType *buzzerParam ;
  for(i=0; i<((buzzerDataType*)param)->number; i++){
    pinMode(BUZZER_PIN, OUTPUT);
    digitalWrite(BUZZER_PIN, HIGH); // buzzer on
    delay(((buzzerDataType*)param)->duration);
    digitalWrite(BUZZER_PIN, LOW); // buzzer off
    delay(((buzzerDataType*)param)->interval);
  }  

  vTaskDelete(NULL);
}    

void doParallelBuzzer(uint16_t number, uint16_t duration, uint16_t interval)
{
  buzzerParam.number   = number;
  buzzerParam.duration = duration;
  buzzerParam.interval = interval;

  xTaskCreatePinnedToCore(
    parallelBuzzer,   // function
    "parallelBuzzer", // name
    2048,             // stack size
    (void *)&buzzerParam,           // parameter
    1,                // priority
    NULL,             // task handle (not needed)
    0                 // core (0 or 1) (do not use 0 if Wifi or BLE active, core 0 is busy)
  );
}


/**************************************************!
   @brief    testRotary()
   @details  Function to test rotary encoder
   @param    boolean *rotButtonPressed : state of rotary encoder button (presently disabled!)
   @param    int64_t *rotPosition : position of rotary encoder
   @return   void
***************************************************/
void testRotary(boolean *rotButtonPressed, int64_t *rotPosition)
{
  logOut(2, (char*)"testRotary: start");
  static long degrees;
  //static bool lastButtonState = HIGH;
  //static bool buttonPressed = false;

  // read encoder switch
  /*
  bool reading =  digitalRead(ENCODER_SW_PIN);
  if (reading == LOW && lastButtonState == HIGH) {
    // button pressed
    buttonPressed = !buttonPressed; // toggle state
    //if(buttonPressed){
    //  LogOut(2, "Rotary encoder button pressed: ON");
    //} else {
    //  LogOut(2, "Rotary encoder button pressed: OFF");
    //}
  }
  */
  button.update();
  if(button.fell()){
    *rotButtonPressed = true; // set button state
  }
  if(button.rose()){
    *rotButtonPressed = false; // reset button state
  }
  // read  encoder position
  *rotPosition = - encoder.getCount(); // +3600; // offset to avoid negative values
  degrees = *rotPosition * 5 % 360 ;
  sprintf(outstring, "Rotary encoder position: %lld , degrees: %ld Button: %s", *rotPosition , degrees, *rotButtonPressed ? "ON" : "OFF");
  logOut(2, outstring);

  //logOut(2, "testRotary: end");
}

/*****************************************************************************! 
  @brief  setup routine
  @details 
  @return void
*****************************************************************************/
void setup()
{
  startTimeMillis = millis(); // remember time when woken up
  Serial.begin(115200);   // set speed for serial monitor

  logOut(2,(char*)"**********************************************************");
  sprintf(outstring,"* %s %s - %s ",PROGNAME, VERSION, BUILD_DATE);
  logOut(2,outstring);
  logOut(2,(char*)"**********************************************************");

  // increment start counter
  wData.startCounter++;

   // initialize rotary encoder
   ESP32Encoder::useInternalWeakPullResistors = puType::up;
   encoder.attachHalfQuad(ENCODER_CLK_PIN, ENCODER_DT_PIN);
   encoder.setCount(0);

