88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
   /*
   // initialize encoder switch at pin ENCODER_SW_PIN
   pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
   // prepare de-bounced button
   button.attach(ENCODER_SW_PIN);
   button.interval(5);
  */
  // button via interrupt
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  attachInterrupt(
    digitalPinToInterrupt(ENCODER_SW_PIN),
    handleButtonInterrupt,
    FALLING
  );

  // initialize the display
  logOut(2,(char*)"before initDisplay()");
  initDisplay(wData.startCounter, FULL_UPDATE_INTERVAL); 

  // Serial port for GPS module
  ss.begin(9600, SERIAL_8N1, RXPin, TXPin); // RX, TX
  gpsTimerHandle = gpsTimer.setInterval(200L, gpsHandler); // set gps test timer to 100 milliseconds

  if(wData.currentMode == MODE_STARTED){ //populate missing data from defaults
    logOut(2,(char*)"===== populating defaults");
    wData.anchorBearingDeg= d_anchorBearingDeg;
    wData.anchorDistanceM = d_anchorDistanceM; 
    wData.alertThreshold  = d_alertThreshold; 
    wData.alarmDistanceM  = d_alarmDistanceM;  
    wData.drawCount       = 0;
    wData.startCounter    = 0;
    wData.targetMeasurementIntervalSec = d_targetMeasurementIntervalSec;
    wData.verbosity       = d_verbosity;
    wData.graphWeight     = d_graphWeight;  }

  if(wData.currentMode == MODE_STARTED){ // tests only with fresh start, to prevent this stuff when waking up after sleep
    // short display test
    if(testDisplayModule)
      testDisplay();  

    if(testBuzzer)        // buzzer test
      //buzzer(1,100,500); 
      doParallelBuzzer(1,100,500);
    if(testDisplayModule) // display test, original from WeAct (manufacturer of the ePaper display)
      testDisplayWeAct();
    if(testBuzzer){       // buzzer test
      logOut(2,(char*)"Testing buzzer");
      for(int i=0; i<5; i++)
      {
         //buzzer(1,100,500-i*75); // buzzer test
         doParallelBuzzer(1,100,500);
         delay(1000); // needed for parallel buzzer
      } 
    }  

    boolean buttonPressed = false; 
    int64_t encoderPos = 0;
    if(testRotaryEncoder){
      for(int i=0;i<30;i++) {
        testRotary(&buttonPressed, &encoderPos );
        delay(500);
      }  
    }  

    if(testGPSModule){
      logOut(2,(char*)"GPS serial started.");
      getGPSStartPosition(&startLat, &startLon); // get start position from GPS

      gps_offset(
        startLat,
        startLon,
        anchorDistance_m,
        anchorBearing_deg,
        &anchorLat,
        &anchorLon
      );
      Serial.print(F("Calculated anchor position: "));
      Serial.print(anchorLat, 6); 
      Serial.print(F(", "));
      Serial.println(anchorLon, 6);
    }
  }  // if just started

} // setup

/*****************************************************************************! 
  @brief  handleExt0Wakeup()
  @details handle wakeup by EXT0 wakeup source = button via GPIO 
  @return void
*****************************************************************************/
void handleExt0Wakeup()
{
    // if woken up by button remember this, may be alert acknowledge
    wData.buttonPressed = true;

    // if in alert mode
    if(!wData.alertON){
      // do something tbd
    } // !alertON
}

/*****************************************************************************! 
  @brief    print_wakeup_reason
  @details  determine wakeup reason
  @param  void
  @return wakeup reason, or 0 if not just woken up
*****************************************************************************/
// https://randomnerdtutorials.com/esp32-deep-sleep-arduino-ide-wake-up-sources/
uint32_t print_wakeup_reason() 
{
  esp_sleep_wakeup_cause_t wakeup_reason;
  static int calls = 0;

  if(calls++ == 0){
    wakeup_reason = esp_sleep_get_wakeup_cause();

    switch (wakeup_reason) {
      case ESP_SLEEP_WAKEUP_EXT0:     logOut(2,(char*)"Wakeup caused by external signal using RTC_IO"); break;
      case ESP_SLEEP_WAKEUP_EXT1:     logOut(2,(char*)"Wakeup caused by external signal using RTC_CNTL"); break;
      case ESP_SLEEP_WAKEUP_TIMER:    logOut(2,(char*)"Wakeup caused by timer"); break;
      case ESP_SLEEP_WAKEUP_TOUCHPAD: logOut(2,(char*)"Wakeup caused by touchpad"); break;
      case ESP_SLEEP_WAKEUP_ULP:      logOut(2,(char*)"Wakeup caused by ULP program"); break;
      default:                        sprintf(outstring,"Wakeup was not caused by deep sleep: %d\n", wakeup_reason); break;
                                      logOut(2, outstring);
    }
    return(wakeup_reason);
  }
  return(0);
}

/*****************************************************************************! 
  @brief    gotoDeepSleep: routine to enter deep sleep
  @details  wakeup possible by GPIO specified. 
  @param  deepSleepTime  time to to into deep sleep
  @return void
*****************************************************************************/
void gotoDeepSleep(gpio_num_t button, uint64_t deepSleepTime)
{
  //**********  TEST override
  // sleeptime = 60 * SECONDS - 1000*(millis()-startTimeMillis);
  uint32_t am = millis();
  sprintf(outstring,"Hibernating for target %ld sec: %lld usec ", 
          wData.targetMeasurementIntervalSec, deepSleepTime);  
  logOut(2,outstring);
  if(deepSleepTime > maxSleeptimeSafetyLimit){
    sprintf(outstring,"Hibernating time %lld usec above safety limit. Reducing to %ld usec    ", 
          deepSleepTime, maxSleeptimeSafetyLimit);  
    logOut(2,outstring);
  }

  // shut down display
  endDisplay(1); // mode 0: power off, mode 1: hibernate
  //1: display.hibernate();  // danach wird beim wieder aufwachen kein Reset des Screens gemacht.
  //0: display.powerOff(); // danach wird beim wieder aufwachen ein voller Reset des Screens gemacht

  // Initiate sleep
  esp_sleep_enable_timer_wakeup(deepSleepTime);   // define sleeptime for timer wakeup
  // and via external pin. only one seems possible.
  // https://randomnerdtutorials.com/esp32-deep-sleep-arduino-ide-wake-up-sources/
  #ifdef LOLIN32_LITE
    //esp_sleep_enable_ext0_wakeup(button, HIGH); // enable wakeup via button1 HIGH
    esp_sleep_enable_ext0_wakeup(button, LOW); // enable wakeup via button1 LOW
  #endif  
  #ifdef CROW_PANEL
    esp_sleep_enable_ext0_wakeup(button, LOW); // enable wakeup via button1
  #endif  
  //rtc_gpio_pullup_dis(button);  //Configure pullup/downs via RTCIO to LOW during deepsleep
  //rtc_gpio_pulldown_en(button); // EXT0 resides in the same power domain (RTC_PERIPH) as the RTC IO pullup/downs.
  rtc_gpio_pullup_en(button);  //Configure pullup/downs via RTCIO to HIGH during deepsleep
  rtc_gpio_pulldown_dis(button); // EXT0 resides in the same power domain (RTC_PERIPH) as the RTC IO pullup/downs.
    
  esp_deep_sleep_start();                               // go to sleep
}

