88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
  // calculate distance between actual position and anchor position
  wData.actAnchorDistanceM = TinyGPSPlus::distanceBetween(wData.actLat,wData.actLon, wData.anchorLat, wData.anchorLon);
  // calculate bearing from first to second position. Here: from anchor to actual position of boat
  wData.actAnchorBearingDeg = TinyGPSPlus::courseTo(wData.anchorLat, wData.anchorLon, wData.actLat,wData.actLon);

  // first check for distance from anchor
  // calc alert counter, based on deviation
  // 10% over adds 1, 30% over adds 3, 100% over adds 10
  if(wData.actAnchorDistanceM > wData.alarmDistanceM)
     wData.alertCount += 10.0* (wData.actAnchorDistanceM / wData.alarmDistanceM -1.0);
  else
    wData.alertCount = 0.0;

  wData.alertON = false;  // start out with no alert
  strcpy(wData.alertReasonString,"None");
  wData.alertReason = 0;

  if(wData.alertCount >= wData.alertThreshold){       // alarm if alert counter above threshold
    wData.alertON = true;
    wData.alertReason += 1;
    strcpy(wData.alertReasonString, "Anchor Distance");
  }  

  if(wData.batteryVoltage < BAT_VOLTAGE_THRESHOLD){   // or alarm if battery voltage too low 
    wData.alertON = true;
    wData.alertReason += 2;
    strcpy(wData.alertReasonString, "Battery Voltage Low");
  }  

  if(wData.batteryPercent < BAT_PERCENT_THRESHOLD){ 
    wData.alertReason += 4;
    wData.alertON = true;
    strcpy(wData.alertReasonString, "Battery Percent Low");
  }

  if(!gps.location.isValid()){                        // or alarm if no GPS reception   
    wData.validGPSLocation = false;  
    wData.alertON = true;
    wData.alertReason += 8;
    strcpy(wData.alertReasonString, "Invalid GPS Location");
  }    
}

void doRoutineWork()
{
  int cnt = 0;
  uint32_t ret;
  boolean gpsValid = false, gpsUpdated = false;
  static int trianglePos = 0; // position of triangle indicator, serves as line selector
  static boolean handleParamchanges = false; // if true, handle parameter changes per line
  uint32_t targetSleepUSec;               // target sleep time in microseconds

  // determine reason for wakeup. if timer wakeup: continue with measurements. 
  // if EXT0 wakeup (button pressed): handleExt0Wakeup()
  ret = print_wakeup_reason(); // determine reason for wakeup
  if(ret == ESP_SLEEP_WAKEUP_EXT0)
    handleExt0Wakeup();

  readBatteryVoltage(&wData.batteryPercent, &wData.batteryVoltage);                  // Auslesen der Batteriespannung  
  //wData.batteryPercent = volt;
  //wData.batteryPercent = percent;

  sprintf(outstring,"doRoutineWork in wData.currentMode:  %d", wData.currentMode);
  logOut(2, outstring);
  delay(100);

  switch(wData.currentMode){
    case MODE_STARTED:    // 0 just switched on
      { 
        do{
          sprintf(outstring,"doRoutineWork: MODE_STARTED, waiting for GPS fix... %d", cnt);
          logOut(2, outstring);
          gpsValid = gpsTest();
        } 
        while(!gpsValid && cnt++<120); // wait up to 120 seconds for gps fix
        setScreenParameters();
        drawInputMainScreen();
        drawInputHeader();
        drawInputData();
        if(gpsValid)
          wData.currentMode = MODE_SELECTLINE; // to to input mode if gps is valid
      }
      break;
    case MODE_SELECTLINE:    // 1 input mode to set position of triangle
      {
        int64_t encoderPos;
        sprintf(outstring,"doRoutineWork: MODE_SELECTLINE ... %d", cnt);
        logOut(2, outstring);
        //gpsValid = gpsTest();
        gpsValid=gps.location.isValid();
        gpsUpdated=gps.location.isUpdated();
        if(gpsValid && gpsUpdated){
          wData.actLat = gps.location.lat();
          wData.actLon = gps.location.lng();
          if(!wData.buttonPressed) // quicker if button pressed
            drawInputHeader();
        }
        
        if(!wData.buttonPressed){ // quicker if button pressed
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle pointing to input data box
          //delay(200); // wait 0,2 seconds
          drawTriangle(false,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle pointing to input data box
        
          encoderPos = encoder.getCount();
          if(encoderPos != 0){
            if(encoderPos > 0)
              trianglePos --; // decrease
            else if(encoderPos < 0)
              trianglePos ++; // increase
            if(trianglePos < 0) // wrap around
              trianglePos = NUM_INPUTDATA_LINES-1;  // max of 8 positions 0..7
            trianglePos = (trianglePos) % NUM_INPUTDATA_LINES; // 8 positions
            sprintf(outstring,"doRoutineWork: Encoder triggered. encoderPos: %ld New trianglePos: %d", (int32_t)encoderPos, trianglePos);
            logOut(2, outstring);
            encoder.setCount(0); // reset encoder count
          }  // encoder
        } // button

        if(wData.buttonPressed){ // button state is checked in main loop
          // wData.buttonPressed = false; // reset button pressed state. not done here, since we want to use it in next state
          sprintf(outstring,"doRoutineWork: MODE_SELECTLINE: Button pressed. Selected trianglePos: %d", trianglePos);
          logOut(2, outstring);
          wData.currentMode = MODE_CHANGEPARAM; // go to change param mode
        }
      }
      break;
    case MODE_CHANGEPARAM:    // 2 input mode to set a specific parameter, defined by last triangePos
      {
        if(!handleParamchanges) // do not draw triangle if already in param change mode, takes too long
        {
          sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM. wData.Button: %d handleParamchanges: %d", 
              wData.buttonPressed, handleParamchanges);
          logOut(2, outstring);
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle
        }
        // if button pressed again, and not yet in param change mode, go to param change mode
        if(wData.buttonPressed && !handleParamchanges){
          handleParamchanges = true;
          wData.buttonPressed = false; // reset button pressed state  
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle once
        }  
        // if button pressed again, and already in param change mode, go back to select line mode
        if(wData.buttonPressed && handleParamchanges){
          handleParamchanges = false;
          wData.buttonPressed = false; // reset button pressed state  
          wData.currentMode = MODE_SELECTLINE; // go to change param mode
        } 

        if(handleParamchanges){
          boolean ret = handleParamChange(trianglePos); // handle parameter change within a line
          if(!ret){ // exit parameter change mode, go to running mode - anchor alarm active
            handleParamchanges = false;
            // get anchor position from current GPS position
            getGPSStartPosition(&wData.actLat, &wData.actLon); // get averaged boat start position from GPS
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Current GPS position Lat: %6.4f Lon: %6.4f", 
                wData.actLat, wData.actLon);  
            logOut(2, outstring);
            // project anchor distance and bearing from start position to get anchor position
            gps_offset(wData.actLat, wData.actLon, wData.anchorDistanceM, wData.anchorBearingDeg, &wData.anchorLat, &wData.anchorLon);
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Anchor position set to Lat: %6.4f Lon: %6.4f", 
                wData.anchorLat, wData.anchorLon);
            logOut(2, outstring);
            //initialize draw buffer
            wData.drawCount = 0;
            for (int i=0; i<maxDrawBufferLen; i++){
              wData.drawBuffer[i][0] = 0;
              wData.drawBuffer[i][1] = 0;
            }
            updatewData(); // populate wData structure for first run, then no update of gps data expected
            wData.currentMode = MODE_RUNNING; // go to change param mode
          }
        }  
      }
      break;  
    case MODE_RUNNING:    // anchor alarm active
      {
        if(!wData.buttonPressed){ // button pressed means: quiet alarm, back to menu
          double startLat = 0.0; double startLon = 0.0;
          sprintf(outstring,"doRoutineWork: MODE_RUNNING ... %d", cnt++);
          logOut(2, outstring);
          
          // we need a bit of time to get the GPS data
          for(int i=0; i<3; i++)
          {  
            if((gps.location.isUpdated() && gps.location.isValid())) 
              break;
            smartDelay(1000);  
          }    
          
          updatewData();
          sprintf(outstring,"doRoutineWork: MODE_RUNNING: Current GPS position Lat: %6.6f Lon: %6.6f", 
              wData.actLat, wData.actLon);                
          logOut(2, outstring);
          
