88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
          sprintf(outstring,"doRoutineWork: MODE_RUNNING: Current distance anchor-boat: %4.2f m Bearing anchor-boat: %4.2f°", 
              wData.actAnchorDistanceM, wData.actAnchorBearingDeg); 
          logOut(2, outstring);
          //} if 
          drawWatchScreen();
          
          if(wData.alertON){    
            buzzer(3, 100,50);
            //doParallelBuzzer(3, 100,50);
            sprintf(outstring,"!!!!!!!!!!!! ALERT Reason %d %s !!!!!!!!!!!!",wData.alertReason, wData.alertReasonString);
            logOut(2,outstring);
            smartDelay(1000);
          }  
          else{
            // sleep for a time: switch off display, deep sleep for ESP32, leave gps receiving
            targetSleepUSec= wData.targetMeasurementIntervalSec * SECONDS;
            gotoDeepSleep(BUTTON1, targetSleepUSec); // go to deep sleep. parameters: sleeptime in us, button to wakeup from  
            //smartDelay(5000);
          } // else alert on


        }
        else{ // button pressed
          wData.buttonPressed = false; // reset button pressed state  
          wData.alertON = false;       // reset alarm
          wData.currentMode = MODE_STARTED; // go to start mode
        }    
      }
      break;
    default:  
    {
      sprintf(outstring,"doRoutineWork: default %d in case statement", trianglePos);
      logOut(2, outstring);
    }
  }  

} // doRoutineWork


/*****************************************************************************! 
  @brief  checkButton()    
  @details 
  @return void
*****************************************************************************/
void checkButton()
{
  if (buttonEvent) {
    buttonEvent = false;
    if(!wData.buttonPressed){
      logOut(2, (char*)"Interrupt: Rotary encoder button released.");
      wData.buttonPressed = true;
      //buzzer(1,50,0); // buzzer feedback
      doParallelBuzzer(1,50,0);
    } 
    sprintf(outstring,"Interrupt: Button wurde gedrückt");
    logOut(2, outstring);
  }
} 

/*****************************************************************************! 
  @brief  main loop
  @details 
  @return void
*****************************************************************************/
void loop() 
{
  // Update the Bounce instance (YOU MUST DO THIS EVERY LOOP)
  /*
  button.update(); // for button debouncing
  int buttonState = button.read();
  if(buttonState == LOW ){
    logOut(2, (char*)"Rotary encoder button pressed.");
    //buzzer(1,50,0); // buzzer feedback
    wData.buttonPressed = true;
  }
  */
  checkButton();

  doRoutineWork();
  gpsTimer.run(); // run gps timer to get data from gps module
};